---
kind: method
id: M:Autodesk.Revit.DB.Architecture.Railing.ResetSupportPosition
zh: 栏杆
source: html/89c19f58-4556-ecb6-1110-ff69e55436b4.htm
---
# Autodesk.Revit.DB.Architecture.Railing.ResetSupportPosition Method

**中文**: 栏杆

Resets the continuous rails support subelements position data.

## Syntax (C#)
```csharp
public void ResetSupportPosition()
```